CSI API ETABS v1

# cCaseStaticLinear Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cCaseStaticLinear

    Public Interface cCaseStaticLinear

    Dim instance As cCaseStaticLinear

    public interface class cCaseStaticLinear

    type cCaseStaticLinear =  interface end

The cCaseStaticLinear type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetInitialCase|  Retrieves the
initial condition assumed for the specified load case.
|
GetLoads|  Retrieves the load data
for the specified load case
|
SetCase|  Initializes a static
linear load case.
|
SetInitialCase|  Sets the initial
condition for the specified load case.
|
SetLoads|  Sets the load data for
the specified analysis case.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com